{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Искомое число \"1\" встречается в массиве 4 раз(а).\n"
     ]
    }
   ],
   "source": [
    "# Требуется вычислить, сколько раз встречается некоторое\n",
    "# число X в массиве A[1..N]. Пользователь в первой строке вводит\n",
    "# натуральное число N – количество элементов в массиве. В последующих\n",
    "# строках записаны N целых чисел Ai\n",
    "# . Последняя строка содержит число X\n",
    "\n",
    "n = int(input('Введите количество элементов массива: '))\n",
    "l = []\n",
    "for i in range(n):\n",
    "    l.append(int(input(\"Введите значение элемента массива: \")))\n",
    "\n",
    "x = int(input('Введите искомое число в массиве: '))\n",
    "count = 0\n",
    "\n",
    "for i in range(len(l)):\n",
    "    if l[i] == x:\n",
    "        count += 1\n",
    "\n",
    "print(f'Искомое число \"{x}\" встречается в массиве {count} раз(а).')\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Искомое число \"1\" встречается в массиве 3 раз(а).\n"
     ]
    }
   ],
   "source": [
    "# Требуется вычислить, сколько раз встречается некоторое\n",
    "# число X в массиве A[1..N]. Пользователь в первой строке вводит\n",
    "# натуральное число N – количество элементов в массиве. В последующих\n",
    "# строках записаны N целых чисел Ai\n",
    "# . Последняя строка содержит число X\n",
    "\n",
    "n = int(input('Введите количество элементов массива: '))\n",
    "l = []\n",
    "for i in range(n):\n",
    "    l.append(int(input(\"Введите значение элемента массива: \")))\n",
    "\n",
    "x = int(input('Введите искомое число в массиве: '))\n",
    "\n",
    "print(f'Искомое число \"{x}\" встречается в массиве {l.count(x)} раз(а).')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Самый близкий по величине элемент к заданному числу 22 равен 10.\n"
     ]
    }
   ],
   "source": [
    "# Требуется найти в списке целых чисел самый близкий по величине элемент к заданному числу X. Пользователь вводит это число с клавиатуры, \n",
    "# список можно считать заданным. Введенное число не обязательно содержится в списке.\n",
    "# Примеры/Тесты:\n",
    "# Input: [10, 5, 7, 3, 3, 2, 5, 7, 3, 8], X = 0\n",
    "# Output: 2\n",
    "# Input: [10, 5, 7, 3, 3, 2, 5, 7, 3, 8], X = 9\n",
    "\n",
    "X = int(input('Задайте число: '))\n",
    "l = [10, 5, 7, 3, 3, 2, 5, 7, 3, 8]\n",
    "l_1 = [0] * len(l)\n",
    "\n",
    "for i in range(len(l)):\n",
    "    l_1[i] = abs(X - l[i])\n",
    "\n",
    "idx = l_1.index(min(l_1))\n",
    "print(f'Самый близкий по величине элемент к заданному числу {X} равен {l[idx]}.')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14\n"
     ]
    }
   ],
   "source": [
    "# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.\n",
    "# В случае с английским алфавитом очки распределяются так:\n",
    "# A, E, I, O, U, L, N, S, T, R – 1 очко;\n",
    "# D, G – 2 очка;\n",
    "# B, C, M, P – 3 очка;\n",
    "# F, H, V, W, Y – 4 очка;\n",
    "# K – 5 очков;\n",
    "# J, X – 8 очков;\n",
    "# Q, Z – 10 очков.\n",
    "# А русские буквы оцениваются так:\n",
    "# А, В, Е, И, Н, О, Р, С, Т – 1 очко;\n",
    "# Д, К, Л, М, П, У – 2 очка;\n",
    "# Б, Г, Ё, Ь, Я – 3 очка;\n",
    "# Й, Ы – 4 очка;\n",
    "# Ж, З, Х, Ц, Ч – 5 очков;\n",
    "# Ш, Э, Ю – 8 очков;\n",
    "# Ф, Щ, Ъ – 10 очков.\n",
    "# Напишите программу, которая вычисляет стоимость введенного пользователем слова. \n",
    "# Будем считать, что на вход подается только одно слово, которое содержит либо только английские, \n",
    "# либо только русские буквы и заранее известно какой алфавит надо использовать.\n",
    "# Примеры/Тесты:\n",
    "# Input:   ноутбук\n",
    "# Output:  12\n",
    "# Input:   notebook\n",
    "# Output:  14\n",
    "\n",
    "Scrabble = {'AEIOULNSTR': 1, 'DG': 2, 'BCMP': 3, 'FHVWY': 4, 'K': 5, 'JX': 8, 'QZ': 10,\n",
    "            'АВЕИНОРСТ': 1, 'ДКЛМПУ': 2, 'БГЁЬЯ': 3, 'ЖЗХЦЧ': 5, 'ШЭЮ': 8, 'ФЩЪ': 10}\n",
    "\n",
    "text = input('Введите слово для определения стоимости: ').upper()\n",
    "result = 0\n",
    "\n",
    "for i in text:\n",
    "    for key, value in Scrabble.items():\n",
    "        if i in key:\n",
    "            result += value\n",
    "\n",
    "print(result)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "b93fce6c5cf69168f1a13ce911c72f30cc77c79194377ddd862c1f46d8218ab1"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
